In [1]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas
import pandas as pd
np.set_printoptions(precision=4, threshold=500)
pd.options.display.max_rows = 100

### 실습 예제 1
컬럼명이 나이, 이름 두 가지로 구성된 데이터프레임 df_ex1, df_ex2를 생성하고, 나이를 기준으로 merge하여 출력하시오.(단, 한 프레임 당 행의 수는 6개 이상)

In [2]:
df_ex1 = DataFrame({'name': ['김', '이', '최', '박', '유', '한'],
                 'age': [24, 30, 50, 49, 27, 10]})
df_ex2 = DataFrame({'name': ['고', '강', '문', '안', '권', '원'],
                 'age': [10, 20, 39, 24, 50, 27]})
pd.merge(df_ex1, df_ex2, on = 'age')

   age name_x name_y
0   24      김      안
1   50      최      권
2   27      유      원
3   10      한      고

### 실습예제 2
0부터 10까지의 Series 자료구조를 만든 후 5 이상의 수를 Nan으로 replace하시오.

In [3]:
se = Series(range(11))
for i in se:
    if i >= 5:
        se = se.replace(i, np.nan)
se

0     0.0
1     1.0
2     2.0
3     3.0
4     4.0
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
dtype: float64

### 실습예제 3
위의 방법을 응용해 100행 5열의 난수로 구성된 데이터프레임을 생성하고 2번 열의 데이터가 음수인 것만 출력하시오.

In [4]:
data = DataFrame(np.random.randn(100, 5))
data = data[(data[2] < 0) ]
data[[2]].head(5)

          2
0 -0.519439
3 -0.371843
6 -2.370232
8 -1.541996
9 -0.753887

### 실습예제 4
생성된 위의 df_with_dummy 데이터프레임의 행의 위치를 랜덤하게 바꿔 출력하시오.

In [5]:
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                'data1': range(6)})
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = dummies.join(df['data1'])

In [6]:
sampler = np.random.permutation(len(df_with_dummy))
df_with_dummy.take(sampler)

   key_a  key_b  key_c  data1
1      0      1      0      1
5      0      1      0      5
3      0      0      1      3
0      0      1      0      0
2      1      0      0      2
4      1      0      0      4

### 실습예제 5
0~100 사이의 난수 10개를 생성하고 데이터가 10 단위의 범주 중 어느 범주에 속하는지를 구하시오

In [7]:
val = np.random.rand(10) * 100
ff = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
pd.get_dummies(pd.cut(val, ff))

,"(0, 10]","(10, 20]","(20, 30]","(30, 40]","(40, 50]","(50, 60]","(60, 70]","(70, 80]","(80, 90]","(90, 100]"
0,0,0,1,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,1,0
2,0,0,0,0,0,0,0,0,0,1
3,0,0,0,0,0,1,0,0,0,0
4,0,1,0,0,0,0,0,0,0,0
5,0,0,0,0,0,0,0,1,0,0
6,0,0,1,0,0,0,0,0,0,0
7,1,0,0,0,0,0,0,0,0,0
8,1,0,0,0,0,0,0,0,0,0
9,0,0,1,0,0,0,0,0,0,0

### 실습예제 6
위의 val문자열의 , 개수와 문자열의 길이를 합한 값을 출력하시오.

In [8]:
val = 'a,b,  guido'
len(val) + val.count(',')

13

### 실습예제 7
위의 val문자열의 '  '(공백)을 찾고 몇 번째 index에 위치해 있는지 나타내시오.

In [9]:
val.index(' ')

4

### 실습예제 8
위의 text에서 이메일이 아닌 단어 단위를 찾아 출력하시오.

In [10]:
import re

In [11]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' #해당 부분에 맞게 정규식 변수 pattern을 지정

# re.IGNORECASE는 대소문자 구분을 없애준다.
regex = re.compile(pattern, flags=re.IGNORECASE)

In [12]:
pattern2 = '[A-Z]{1,10}'
regex2 = regex = re.compile(pattern2, flags=re.IGNORECASE)
regex2.findall(text)

['Dave',
 'dave',
 'google',
 'com',
 'Steve',
 'steve',
 'gmail',
 'com',
 'Rob',
 'rob',
 'gmail',
 'com',
 'Ryan',
 'ryan',
 'yahoo',
 'com']

### 실습예제 9
예제 8에서 찿은 단어들을 'python'으로 치환하시오.

In [13]:
print(regex2.sub('python', text))

python python@python.python
python python@python.python
python python@python.python
python python@python.python

### 실습예제10
data의 isnull()함수를 호출한 값에 True가 없도록 하는 data2를 만들고 다시 isnull()함수를 호출하시오.

In [14]:
data2 = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': 'Wes@naver.com'}
data2 = Series(data2)
data2.isnull()

Dave     False
Rob      False
Steve    False
Wes      False
dtype: bool

In [15]:
import json
db = json.load(open('data/foods-2011-10-03.json'))


### 실습예제11
위의 첫 번째 항목의 영양소를 표시한 것 처럼, 식품의 양(portions)을 출력하시오.

In [16]:
db[0]['portions'][0] #이것만 답

{'amount': 1, 'grams': 28.35, 'unit': 'oz'}

In [17]:
info_keys = ['description', 'group', 'id', 'manufacturer']
info = DataFrame(db, columns=info_keys)

In [20]:
nutrients = DataFrame(db[0]['nutrients'])

### 실습예제 12
영양소 자료구조의 그룹의 분포 출력하시오.

In [21]:
pd.value_counts(nutrients.group)[:10] #답

Amino Acids    54
Vitamins       42
Elements       30
Other          15
Composition    15
Energy          6
Name: group, dtype: int64

In [22]:
nutrients = []

for rec in db: #data cleaning을 위해 영양소 리스트의 id를 같은 음식별로 묶는 함수 rec
    fnuts = DataFrame(rec['nutrients'])
    fnuts['id'] = rec['id']
    nutrients.append(fnuts)

nutrients = pd.concat(nutrients, ignore_index=True) #concat함수를 이용해 기존의 nutrients에 id column을 새로 생성하여 붙임.

In [23]:
nutrients = nutrients.drop_duplicates()

In [24]:
col_mapping = {'description' : 'food',
               'group'       : 'fgroup'}
info = info.rename(columns=col_mapping, copy=False) #col_mapping에서 새로 정한 이름으로 info를 rename

### 실습예제13
위의 col_mapping의 'id'컬럼을 'food_id'로 변경하시오.

In [25]:
col_mapping2 = {'id' : 'food_id'}
info2 = info.rename(columns=col_mapping, copy=False)
info2.head(5)

,food,fgroup,id,manufacturer
0,"Cheese, caraway",Dairy and Egg Products,1008,
1,"Cheese, cheddar",Dairy and Egg Products,1009,
2,"Cheese, edam",Dairy and Egg Products,1018,
3,"Cheese, feta",Dairy and Egg Products,1019,
4,"Cheese, mozzarella, part skim milk",Dairy and Egg Products,1028,

In [26]:
col_mapping = {'description' : 'nutrient',
               'group' : 'nutgroup'}
nutrients = nutrients.rename(columns=col_mapping, copy=False)

### 실습예제 14
nutrients와 info를 innerjoin한 ndata2를 생성하시오.

In [27]:
ndata = pd.merge(nutrients, info, on='id', how='inner')

In [30]:
ndata.head(5)

,nutrient,nutgroup,units,value,id,food,fgroup,manufacturer
0,Protein,Composition,g,25.18,1008,"Cheese, caraway",Dairy and Egg Products,
1,Total lipid (fat),Composition,g,29.20,1008,"Cheese, caraway",Dairy and Egg Products,
2,"Carbohydrate, by difference",Composition,g,3.06,1008,"Cheese, caraway",Dairy and Egg Products,
3,Ash,Other,g,3.28,1008,"Cheese, caraway",Dairy and Egg Products,
4,Energy,Energy,kcal,376.00,1008,"Cheese, caraway",Dairy and Egg Products,